src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	
	Для Каждого ТекВид Из Метаданные.Перечисления.ВидыДоговоровКонтрагентов.ЗначенияПеречисления Цикл 
		Если ТекВид.Имя = "СКомитентомНаЗакупку" Или ТекВид.Имя = "СКомиссионеромНаЗакупку" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не Параметры.СтрокаПоиска = Неопределено И ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда 
			ДлинаСтрокиПодбора = СтрДлина(Параметры.СтрокаПоиска);
			
			Если НРег(Лев(ТекВид.Синоним, ДлинаСтрокиПодбора)) = НРег(Параметры.СтрокаПоиска) Тогда 
				тПредставление = Новый ФорматированнаяСтрока(
					Новый ФорматированнаяСтрока(Лев(ТекВид.Синоним, ДлинаСтрокиПодбора),, ЦветаСтиля.уатЦветТекстаПриАвтоподборе), 
					Новый ФорматированнаяСтрока(Прав(ТекВид.Синоним, СтрДлина(ТекВид.Синоним)-ДлинаСтрокиПодбора)));
				ДанныеВыбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов[ТекВид.Имя], тПредставление);
			КонецЕсли;
			
		Иначе 
			ДанныеВыбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов[ТекВид.Имя]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
